In [65]:
# Importe o pandas
import pandas as pd

In [66]:
# Crie uma Série com 3 estados diferentes
series1 = pd.Series(['Minas Gerais', 'Rio de Janeiro', 'Bahia'])

In [67]:
# Visualize os dados criados na Série
series1

0      Minas Gerais
1    Rio de Janeiro
2             Bahia
dtype: object

In [68]:
# Crie uma Série com 3 tipos de fabricantes de carro
series2 = pd.Series(['Honda', 'Nissan', 'Volvo'])
series2

0     Honda
1    Nissan
2     Volvo
dtype: object

In [69]:
# Crie um DataFrame combinando as duas Séries
series_df = pd.DataFrame({
    'Estados': ['Minas Gerais', 'Rio de Janeiro', 'Bahia'],
    'Fabricantes': ['Honda', 'Nissan', 'Volvo']
})
series_df

          Estados Fabricantes
0    Minas Gerais       Honda
1  Rio de Janeiro      Nissan
2           Bahia       Volvo

In [70]:
# Importe o csv "venda-de-carros.csv" em visualize o DataFrame
venda = pd.read_csv('/home/youx/teste_git/youxlab-treino-git/python-tayla/aulas-dados/datasets/venda-de-carros.csv')
venda

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [71]:
# Verifique os diferentes tipos de dados do DataFrame
venda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [72]:
# Verifique as informações estatísticas do DataFrame usando .describe()
venda.describe()

       Quilometragem     Portas
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [73]:
# Liste mais informações sobre o DataFrame usando a função info()
venda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [74]:
# Liste o nome de todas as colunas do DataFrame
lista_colunas = list(venda.columns)
lista_colunas

['Fabricante', 'Cor', 'Quilometragem', 'Portas', 'Preco']

In [75]:
# Exiba apenas as 5 primeiras linhas do DataFrame
venda.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [76]:
# Exiba as 5 últimas linhas do DataFrame
venda.iloc[[5,6,7,8,9]]

  Fabricante     Cor  Quilometragem  Portas         Preco
5     Toyota   Verde          99213       4  R$ 14,500.00
6      Honda    Azul          45698       4  R$ 17,500.00
7      Honda    Azul          54738       4  R$ 27,000.00
8     Toyota  Branco          60000       4  R$ 26,250.00
9     Nissan  Branco          31600       4  R$ 19,700.00

In [77]:
# Utilize .loc para selecionar os dados da linha de índice 3 do DataFrame
venda.loc[3]

Fabricante                 BMW
Cor                      Preto
Quilometragem            11179
Portas                       5
Preco            R$ 122,000.00
Name: 3, dtype: object

In [78]:
# Utilize .iloc para exibir os dados que estão na 5° posição do DataFrame
venda.iloc[5]

Fabricante             Toyota
Cor                     Verde
Quilometragem           99213
Portas                      4
Preco            R$ 14,500.00
Name: 5, dtype: object

In [79]:
# Selecione a coluna Quilometragem
venda[['Quilometragem']]

   Quilometragem
0         150043
1          87899
2          32549
3          11179
4         213095
5          99213
6          45698
7          54738
8          60000
9          31600

In [80]:
# Calcule a média da coluna Quilometragem
print(venda['Quilometragem'].mean())

78601.4

In [81]:
# Liste os carros que possuem uma quilometragem maior que 100.000
venda[venda['Quilometragem'] >= 100000]

  Fabricante     Cor  Quilometragem  Portas         Preco
0     Toyota  Branco         150043       4  R$ 24,000.00
4     Nissan  Branco         213095       4  R$ 13,500.00

In [82]:
# Agrupe as colunas pelo fabricante e calcule a média das outras colunas
agrupamento = venda.groupby('Fabricante')
agrupamento.describe()

           Quilometragem                                                   \
                   count           mean            std      min       25%
Fabricante
BMW                  1.0   11179.000000            NaN  11179.0  11179.00
Honda                3.0   62778.333333   22219.728179  45698.0  50218.00
Nissan               2.0  122347.500000  128336.345251  31600.0  76973.75
Toyota               4.0   85451.250000   51015.991325  32549.0  53137.25

                                          Portas                             \
                 50%        75%       max  count  mean  std  min   25%  50%
Fabricante
BMW          11179.0   11179.00   11179.0    1.0  5.00  NaN  5.0  5.00  5.0
Honda        54738.0   71318.50   87899.0    3.0  4.00  0.0  4.0  4.00  4.0
Nissan      122347.5  167721.25  213095.0    2.0  4.00  0.0  4.0  4.00  4.0
Toyota       79606.5  111920.50  150043.0    4.0  3.75  0.5  3.0  3.75  4.0


            75%  max
Fabricante
BMW         5.0  5.0
Honda       4.0  4.0
Nissan      4.0  4.0
Toyota      4.0  4.0